lsql/DESIGN.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-16 Fri 01:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org675b527">1. Overview</a>
<ul>
<li><a href="#org95c549e">1.1. Examples of lsql expressions</a></li>
</ul>
</li>
<li><a href="#org0b3d259">2. Operators</a>
<ul>
<li><a href="#org5331b24">2.1. select (sel)</a></li>
<li><a href="#orgc238966">2.2. group</a></li>
<li><a href="#org1541d69">2.3. join, to</a></li>
<li><a href="#orgd783bd6">2.4. order, asc(end)(ing), desc(end)(ing)</a></li>
<li><a href="#org76e257d">2.5. mapt</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org675b527" class="outline-2">
<h2 id="org675b527"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
lsql is a tool for multi-target, multi-system tabular data analysis
written as expressions (statements with return values).  The core
design principles are
</p>

<ul class="org-ul">
<li><p>
Expression-based language: Everything is an expression,
including objects.  Every expression has a value.
</p>

<p>
This is not true for SQL.  E.g.:
</p>
<div class="org-src-container">
<pre class="src src-sql">  select * from tab;
</pre>
</div>
<p>
returns a table from a table. But:
</p>
<div class="org-src-container">
<pre class="src src-sql">  tab;
</pre>
</div>
<p>
returns an error since it is not a valid SQL query.
</p></li>
<li><p>
lsql is closed: Every lsql object can be an argument to another
lsql expression.
</p>

<p>
Not true for SQL.  E.g., given t1(x,y) and t2(x,z):
</p>
<div class="org-src-container">
<pre class="src src-sql">  select * from t1 join t2 on t1.x=t2.x
</pre>
</div>
<p>
returns a table with two columns named "x".  This will be returned
to you as a "table" from the SQL client, but if you try to use this
in a CTE or insert the values into a table, the SQL server will
signal an error since columns must have different names.
</p></li>
<li>Multi-server: lsql expressions can refer to data located on any
system which has been defined, including the host system.  lsql
expressions can be compiled to execute as SQL queries on SQL servers
or as Lisp code executed on the host system.</li>
</ul>

<p>
The main goal of lsql is ease of data analysis and manipulation across
multiple systems without the need for explicit transfer code.
</p>
</div>

<div id="outline-container-org95c549e" class="outline-3">
<h3 id="org95c549e"><span class="section-number-3">1.1.</span> Examples of lsql expressions</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sql">-- SQL
select * from tab
</pre>
</div>
<p>
In lsql, tables can be returned directly:
</p>
<div class="org-src-container">
<pre class="src src-lisp">;; lsql
tab
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">-- SQL
select a.x, b.y, c.z
from a
join b
  on a.w = b.w
join c
  on b.w = c.w
</pre>
</div>
<p>
The syntax <code>@&lt;table&gt;(&lt;field1&gt; [field2] [field3]...)</code> is used to denote
references to a field in a table.  The fields are referenced via
symbols without evaluation.  (An alternate form is available when
evaluation is needed to access the field symbol.)
</p>
<div class="org-src-container">
<pre class="src src-lisp">;; lsql
(sel (@a(x) @b(y) @c(z))
     (join a
           (to b (= @a(w) @b(w)))
           (to c (= @b(w) @c(w)))))
</pre>
</div>

<p>
Some operators from SQL have new aliases for aesthetics:
</p>

<ul class="org-ul">
<li><code>like</code>: <code>~=</code>, <code>equalp</code></li>
<li><code>=</code>:    <code>equal</code></li>
<li><code>asc</code>:  <code>&lt;=</code>, <code>:asc</code></li>
<li><code>desc</code>: <code>&gt;=</code>, <code>:desc</code></li>
</ul>

<p>
E.g.:
</p>
<div class="org-src-container">
<pre class="src src-sql">-- SQL
select *
from tab
where x like y
order by z asc
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp">(sel *
     ;; could just return table without (sel * ...)
     (order (filter tab (~= x y))
            z :asc))
</pre>
</div>

<p>
The section <a href="#org0b3d259">Operators</a> has more detailed information on the specific
operators supported, their syntax and semantics.
</p>
</div>
</div>
</div>
<div id="outline-container-org0b3d259" class="outline-2">
<h2 id="org0b3d259"><span class="section-number-2">2.</span> Operators</h2>
<div class="outline-text-2" id="text-2">
<p>
Operators are the fundamental building block of lsql code.
</p>

<p>
Operators generally have a publicly exposed macro and some number of
private functions that provide the implementation of this operator in
different contexts.
</p>
</div>
<div id="outline-container-org5331b24" class="outline-3">
<h3 id="org5331b24"><span class="section-number-3">2.1.</span> select (sel)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>select</code> or <code>sel</code> functions much like in SQL where it is used to
construct tables from scalar values or computations applied to other
tables.  E.g.
</p>

<div class="org-src-container">
<pre class="src src-lisp">;; select * from tab
(sel * tab)
</pre>
</div>

<p>
References to tables are facilitated via the <code>field</code> data type along
with a helpful reader syntax:
</p>

<div class="org-src-container">
<pre class="src src-lisp">;; select A.X, A.Y from ...
(sel (@A(X) @B(Y)) ...)
</pre>
</div>

<p>
Named fields use the syntax <code>(name value)</code> in the selection list
(similar to other Lisp binding operations):
</p>

<div class="org-src-container">
<pre class="src src-lisp">;; select A.X as "A_X", B.Y as "B_Y" from ...
(sel ((A_X @A(X))
      (B_Y @B(Y)))
     ...)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc238966" class="outline-3">
<h3 id="orgc238966"><span class="section-number-3">2.2.</span> group</h3>
</div>
<div id="outline-container-org1541d69" class="outline-3">
<h3 id="org1541d69"><span class="section-number-3">2.3.</span> join, to</h3>
</div>
<div id="outline-container-orgd783bd6" class="outline-3">
<h3 id="orgd783bd6"><span class="section-number-3">2.4.</span> order, asc(end)(ing), desc(end)(ing)</h3>
</div>
<div id="outline-container-org76e257d" class="outline-3">
<h3 id="org76e257d"><span class="section-number-3">2.5.</span> mapt</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<code>mapt</code> is the lsql table mapping operation.  Mapping is not a SQL
operation, but it is extremely useful and something that is often
effectively performed through dynamically-generated SQL queries.
</p>

<p>
Ordinarily, mapping takes a list of objects, a function that
transforms each element, and returns a list which is the result of
calling the function on each object in the original list.  However,
because SQL does not directly support nested tabular data, <code>map</code> in
lsql will perform a <code>union all</code> operation on the results of each
mapping operation.
</p>

<p>
Mapping in general programming would be of little use without the
ability to define an anonymous function, or &lambda; function in
computer science parlance.  To that end, the operator <code>lambda</code> has
been provided as a way to specify a function that accepts some number
of input arguments that will be used with map.  If the type of
argument is a table, lsql will intelligently choose a way to achieve
the computation, be it with dynamic SQL or Lisp code.
</p>

<p>
Examples:
</p>
<div class="org-src-container">
<pre class="src src-lisp">;; trivial example
;;
;; equivalent to
;; 
;; select a.x+b.x as "x",
;;        a.y+b.y as "y"
;; from a join b on a.z = b.z
(mapt (sel ((x (+ @a(x) @b(x)))
            (y (* @a(y) @b(y)))))
      (join a (to b (= @a(z) @b(z)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp">;; dynamic SQL example
;;
;; This equivalent to generating queries of the form
;;
;; select '&lt;table&gt;' as "name", count(1) as "count"
;; from &lt;table&gt;
;;
;; with a value of &lt;table&gt; being a.name for each row in a, and then
;; performing a union all of the result row from each individual
;; selection query.  This is a common operation in SQL that requires
;; dynamically-generated SQL queries using SQL itself or a
;; programmatical client like Python or Lisp via ODBC.  lsql
;; eliminates the need for extra complexity:
(mapt (lambda (tab)
        (sel ((name @tab(name))
              (count (agg ((count (count 1)))
                          (sys1 @tab(name)))))
              tab))
      (sel (name)
           (sys1 a)))
</pre>
</div>

<p>
Notice that <code>sys1</code> occurs as an operator.  Systems that have been
defined can be used as operators that accept the name of a table as an
input argument and return a reference to the table.  In this case,
<code>sys1</code> is used as a contrived example system.
</p>

<p>
For convenience, it is also possible to specify a default system in
which all queries should run unless stated otherwise.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(on sys1
  (mapt (lambda (tab)
          (sel ((name @tab(name))
                (count (agg ((count (count 1)))
                            @tab(name))))
               tab))
        (sel (name)
             a)))
</pre>
</div>

<p>
In this case, there is no need to specify the system in the table
arguments since sys1 will be used by default.  Operators that accept
table references as arguments are designed to automatically convert
symbol/string input values to table references in the default system.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-08-16 Fri 01:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
